# Data Preprocessing and Cleaning

In [1]:
import sys
import os
sys.path.append('../scripts')
from data_loader import *
from data_cleaner import *

## Load Datasets

In [13]:
# path to the CSV file
filename1 = 'BrentOilPrices.csv'
filename2 = 'gdp_growth_rate.csv'
filename3 = 'inflation_rate.csv'
filename4 = 'oil_consuption_by_country.csv'
filename5 = 'opec_policy_changes.csv'
filename6 = 'sanction_data.csv'
filename7 = 'unemployment_rate_data.csv'
filename8 = 'usd_exchange_rate.csv'
filename9 = 'conflict_data.csv'

path1 = os.path.join('..', 'data/raw', filename1)
path2 = os.path.join('..', 'data/raw', filename2)
path3 = os.path.join('..', 'data/raw', filename3)
path4 = os.path.join('..', 'data/raw', filename4)
path5 = os.path.join('..', 'data/raw', filename5)
path6 = os.path.join('..', 'data/raw', filename6)
path7 = os.path.join('..', 'data/raw', filename7)
path8 = os.path.join('..', 'data/raw', filename8)
path9 = os.path.join('..', 'data/raw', filename9)

# Load dataset
brent_oil_price_df = load_data(path1)
gdp_df = load_data(path2)
inflation_df = load_data(path3)
oil_consumption_df = load_data(path4)
opec_policy_df = load_data(path5)
sanction_df = load_data(path6)
unemployment_rate_df = load_data(path7)
usd_ex_rate_df = load_data(path8)
conflict_df = load_data(path9)

## Brent Oil Price Data

In [3]:
brent_oil_price_df.head()

        Date  Price
0  20-May-87  18.63
1  21-May-87  18.45
2  22-May-87  18.55
3  25-May-87  18.60
4  26-May-87  18.63

## GDP Growth Rate Data

In [14]:
gdp_df.head()

,year,1980,1981,1982,1983,1984,1985,1986,1987,1988,...,2013,2014,2015,2016,2017,2018,2019,2020,2021,2022
0,Afghanistan,no data,no data,no data,no data,no data,no data,no data,no data,no data,...,5.7,2.7,1,2.2,2.6,1.2,3.9,-2.4,-14.5,-6.2
1,Albania,2.7,5.7,2.9,1.1,2,-1.5,5.6,-0.8,-1.4,...,1,1.8,2.2,3.3,3.8,4,2.1,-3.3,8.9,4.8
2,Algeria,-5.4,3,6.4,5.4,5.6,5.6,-0.2,-0.7,-1.9,...,2.6,4.1,3.2,3.9,1.5,1.4,0.9,-5,3.8,3.6
3,Andorra,no data,no data,no data,no data,no data,no data,no data,no data,no data,...,-3.5,2.5,1.4,3.7,0.3,1.6,2,-11.2,8.3,9.6
4,Angola,2.4,-4.4,0,4.2,6,3.5,2.9,4.1,6.1,...,5,4.8,0.9,-2.6,-0.2,-1.3,-0.7,-5.6,1.2,3

## Inflation Rate Data

In [15]:
inflation_df.head()

,year,1980,1981,1982,1983,1984,1985,1986,1987,1988,...,2013,2014,2015,2016,2017,2018,2019,2020,2021,2022
0,Afghanistan,no data,no data,no data,no data,no data,no data,no data,no data,no data,...,7.4,4.7,-0.7,4.4,5,0.6,2.3,5.6,7.8,10.6
1,Albania,no data,no data,no data,no data,no data,no data,no data,no data,no data,...,1.9,1.6,1.9,1.3,2,2,1.4,1.6,2,6.7
2,Algeria,9.7,14.6,6.6,7.8,6.3,10.4,14,5.9,5.9,...,3.3,2.9,4.8,6.4,5.6,4.3,2,2.4,7.2,9.3
3,Andorra,no data,no data,no data,no data,no data,no data,no data,no data,no data,...,0.5,-0.1,-1.1,-0.4,2.6,1,0.5,0.1,1.7,6.2
4,Angola,46.7,1.4,1.8,1.8,1.8,1.8,1.8,1.8,1.8,...,8.8,7.3,9.2,30.7,29.8,19.6,17.1,22.3,25.8,21.4

## Oil Consumption Data

In [12]:
oil_consumption_df.head()

,year,1987,1988,1989,1990,1991,1992,1993,1994,1995,...,2014,2015,2016,2017,2018,2019,2020,2021,2022,2023
0,World,63065.3472,64947.83863,66046.8037,66658.53165,66930.59273,67185.41879,66989.72191,68376.3034,69797.4446,...,93695.77471,95474.73849,96960.72652,99064.62705,100064.7229,100848.8289,91692.33623,97558.73209,99844.6326,NaN
1,Afghanistan,13.86794,13.18628,13.37298,13.57298,12.75473,7.13639,7.13649,6.63649,6.43649,...,27.67774521,34.91494514,25.59086071,23.63118904,30.60466027,24.27624384,23.00704267,25.84910518,27.09918998,NaN
2,Albania,33.9,31.6,27,19.984,17.92538,20.42626,16.72158,13.21491,14.8139,...,28.13148164,26.061698,27.170328,35.32568902,33.05213699,26.39334247,24.23804818,25.77624345,26.30690554,NaN
3,Algeria,167.4,172.7,182.9,193.5,208.1,210.5,206.2,203.6,204.5,...,415.6059726,431.2676164,420.72377,407.3850959,418.1701973,450.5244658,412.5958942,414.5817894,427.6063201,NaN
4,American Samoa,3.32117,3.22112,3.72931,3.92931,3.92931,4.02895,3.92931,3.82931,3.72931,...,2.34564585,2.345645,2.345646,2.34564585,2.34564585,2.34564585,2.22832,2.58016,2.58,NaN

## OPEC Policy Changes Data

In [16]:
opec_policy_df.head()

  entity policy_change_type policy_change_start_date policy_change_end_date
0   OPEC    Production Cuts               12/14/1986             1987-03-16
1   OPEC    Production Cuts               12/09/1987             1988-03-28
2   OPEC    Production Cuts                12/7/1988             1989-03-13
3   OPEC    Production Cuts               1989-11-20             1990-03-12
4   OPEC    Production Cuts               11/07/1990             1991-03-11

## Sanctions On Major Oil Producing Countries Data

In [17]:
sanction_df.head()

,country,sanction_type,impact_on_trade,sanction_start_date,sanction_end_date
0,Russia,"Export Controls,Financial Sanctions",high,01/01/2014,NaN
1,Russia,Shipping and Transport Restrictions,high,01/01/2022,NaN
2,Saudi Arabia,Shipping and Transport Restrictions,high,01/01/2017,NaN
3,Iraq,multiple sanctions,high,01/08/1990,22/05/2003
4,Kuwait,Trade Embargo,high,02/08/1990,06/11/1994

## Unemployment Rate Data

In [18]:
unemployment_rate_df.head()

,Country Name,Country Code,Series Name,Series Code,1987 [YR1987],1988 [YR1988],1989 [YR1989],1990 [YR1990],1991 [YR1991],1992 [YR1992],...,2014 [YR2014],2015 [YR2015],2016 [YR2016],2017 [YR2017],2018 [YR2018],2019 [YR2019],2020 [YR2020],2021 [YR2021],2022 [YR2022],2023 [YR2023]
0,World,WLD,"Unemployment, total (% of total labor force) (...",SL.UEM.TOTL.ZS,..,..,..,..,4.99634037189047,5.14993854227532,...,6.01622857271861,6.04884902024336,6.01033134504685,5.91614141999205,5.75639790322219,5.5829801043763,6.58528753143071,6.03376129229279,5.26461597288318,4.96143065047416
1,Afghanistan,AFG,"Unemployment, total (% of total labor force) (...",SL.UEM.TOTL.ZS,..,..,..,..,7.946,7.94,...,7.915,9.011,10.1,11.184,11.206,11.224,11.71,11.934,14.1,14.386
2,Albania,ALB,"Unemployment, total (% of total labor force) (...",SL.UEM.TOTL.ZS,..,..,..,..,10.304,30.007,...,18.055,17.193,15.418,13.616,12.304,11.466,12.79,12.473,11.588,11.584
3,Algeria,DZA,"Unemployment, total (% of total labor force) (...",SL.UEM.TOTL.ZS,..,..,..,..,20.6,24.38,...,10.207,11.206,10.202,12,12.15,12.285,14.04,13.607,12.437,11.814
4,American Samoa,ASM,"Unemployment, total (% of total labor force) (...",SL.UEM.TOTL.ZS,..,..,..,..,..,..,...,..,..,..,..,..,..,..,..,..,..

## USD Exchange Rate Date

In [19]:
usd_ex_rate_df.head()

,Date,Open,High,Low,Close,Adj Close,Volume
0,1987-01-02,103.400002,103.639999,103.339996,103.610001,103.610001,0.0
1,1987-01-04,NaN,NaN,NaN,NaN,NaN,NaN
2,1987-01-05,103.809998,104.349998,103.430000,104.139999,104.139999,0.0
3,1987-01-06,103.779999,103.849998,103.519997,103.699997,103.699997,0.0
4,1987-01-07,104.089996,104.269997,103.959999,104.080002,104.080002,0.0

## Conflict in Major Oil Producing Countries Data

In [20]:
conflict_df.head()

,country,conflict_type,impact_on_trade,conflict_start_date,conflict_end_date
0,Indonesia,Separatist conflict in Aceh\r,High,04/12/1976,15/08/2005
1,Saudi Arabia,Tensions with Iran,Medium,01/01/1979,NaN
2,Russia,Russo-Chechen Conflict,High,11/12/1994,16/04/2009
3,Russia,Russo-Ukrainian Conflict,high,20/02/2014,NaN
4,Iraq,Gulf War,high,02/08/1990,28/02/1991